#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform

Running plan in HCP Terraform. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/teste-carla/novo-workspace/runs/run-MEQ2RVCa8GmUtrYh

Waiting for the plan to start...

Terraform v1.9.5
on linux_amd64
Initializing plugins and modules...
aws_eks_cluster.tech: Refreshing state... [id=tech]
aws_eks_node_group.techNode: Refreshing state... [id=tech:techNode]
aws_eks_cluster.tech: Drift detected (delete)
aws_eks_node_group.techNode: Drift detected (delete)

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # aws_eks_cluster.tech has been deleted
  - resource "aws_eks_cluster" "tech" {
      - certificate_authority = [
          - {
              - data = "LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSURCVENDQWUyZ0F3SUJBZ0lJVjJFUHVIbWhMRzR3RFFZSktvWklodmNOQVFFTEJRQXdGVEVUTUJFR0ExVUUKQXhNS2EzVmlaWEp1WlhSbGN6QWVGdzB5TkRBNU1UY3hNVFF3TURaYUZ3MHpOREE1TVRVeE1UUTFNRFphTUJVeApFekFSQmdOVkJBTVRDbXQxWW1WeWJtVjBaWE13Z2dFaU1BMEdDU3FHU0liM0RRRUJBUVVBQTRJQkR3QXdnZ0VLCkFvSUJBUUM2cTE4RHc4OWQ2akErT0tGSVJ6Q3M5aE80OUkzLzBrL3NrVWNneEdBcm9nMVl4UHZ1VEp1T1NwVWgKR05yVzBTVzFFQkhKaUxRS3ZwRUdQZklKd2szbVdBVlZ2M0RweW9ZNXlIbUxUZXFkMjZyTnBHR05DVlBobWRNZApLRDlseGF4OUxTQklFeWhCT0Z0eExtMjh0ZmFNNkhqZ0tnS1NPaDBwMnpSbXVaa3YzbVZudmhmU0Y1LzVsSC9VCnNPd0JUVkFKVDEvRGZqbTRQMmJ4RTR3azZUQlN0RFh4dVVEc0tMSitlUjBoR0F5NWFMRDRCWStJKzZpN2d6WHMKRk1Fbkg5R3N1M1IrbHc2b3hmb2NwakE3L1dkQVdIS0F5TStQdTBxN3lOYXNPcXpsMG5zQnFHVGJyQlo1dTkxSwozcGovODI1WTdPMGdGSzBuN3plL2xSVGw0S0JkQWdNQkFBR2pXVEJYTUE0R0ExVWREd0VCL3dRRUF3SUNwREFQCkJnTlZIUk1CQWY4RUJUQURBUUgvTUIwR0ExVWREZ1FXQkJTK056U2txa3RRRkxGdWlqTFRyT2huT2NEZ1ZEQVYKQmdOVkhSRUVEakFNZ2dwcmRXSmxjbTVsZEdWek1BMEdDU3FHU0liM0RRRUJDd1VBQTRJQkFRQjhObkdlbk1WcwphZ2lFRWVaa1lVVHdvMHpuSUNwYXZJdjNrQk55bFJqbnNHSEkzcVA1SXlxME00ZEI2U3QxNE5peFBwemdYQlB2CjFLNUxDaWovVEtURFhzVVFYS3llcEp1NzBKZExqQTNGbkFUeXVxMmZjL0V4cGpNdkg0bWpJbTlhVm52SXRyVzgKYnVxU212ZDQzMXNJTy9EbENmRkdFbEJac0ZUZUpNME1TREZPMEFqUmJYandXenFNTFJHOEQ2d244UlMrb0haOAprVmtZN3ZhZjFPL2Y3OHdQem4xYWNEQTVRT25hNEtPZStJbEVVaGYwWDNXTTRscUlVTVZlV3hDQmQzaEhTZ3dQCnBIenhmNWIwMDBqRkxQMk1sOE1zQlEyRCtWRVhuQVBWcHlNMTA0QTMrYVZOMFU2M0hqcXVEUmFKRE1NTUhFUGgKNVRNUTQxSkFMUUhVCi0tLS0tRU5EIENFUlRJRklDQVRFLS0tLS0K"
            },
        ] -> null
      - endpoint              = "https://83A2FEC3DDDD7F8F19EF28106401AE41.gr7.us-east-1.eks.amazonaws.com" -> null
        id                    = "tech"
      - name                  = "tech" -> null
        # (8 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_eks_cluster.tech will be created
  + resource "aws_eks_cluster" "tech" {
      + arn                   = (known after apply)
      + certificate_authority = (known after apply)
      + cluster_id            = (known after apply)
      + created_at            = (known after apply)
      + endpoint              = (known after apply)
      + id                    = (known after apply)
      + identity              = (known after apply)
      + name                  = "tech"
      + platform_version      = (known after apply)
      + role_arn              = "arn:aws:iam::019248244455:role/LabRole"
      + status                = (known after apply)
      + tags_all              = (known after apply)
      + version               = (known after apply)

      + kubernetes_network_config (known after apply)

      + vpc_config {
          + cluster_security_group_id = (known after apply)
          + endpoint_private_access   = false
          + endpoint_public_access    = true
          + public_access_cidrs       = (known after apply)
          + subnet_ids                = [
              + "subnet-0325b5cac1ee3e454",
              + "subnet-0833e12ffa4a55d9d",
              + "subnet-0881e6a0db7076117",
              + "subnet-0e428c2048aa24337",
              + "subnet-0f50fff036e7ecf17",
            ]
          + vpc_id                    = (known after apply)
        }
    }

  # aws_eks_node_group.techNode will be created
  + resource "aws_eks_node_group" "techNode" {
      + ami_type               = (known after apply)
      + arn                    = (known after apply)
      + capacity_type          = (known after apply)
      + cluster_name           = "tech"
      + disk_size              = (known after apply)
      + id                     = (known after apply)
      + instance_types         = [
          + "t3.small",
        ]
      + node_group_name        = "techNode"
      + node_group_name_prefix = (known after apply)
      + node_role_arn          = "arn:aws:iam::019248244455:role/LabRole"
      + release_version        = (known after apply)
      + resources              = (known after apply)
      + status                 = (known after apply)
      + subnet_ids             = [
          + "subnet-0325b5cac1ee3e454",
          + "subnet-0833e12ffa4a55d9d",
          + "subnet-0881e6a0db7076117",
          + "subnet-0e428c2048aa24337",
          + "subnet-0f50fff036e7ecf17",
        ]
      + tags_all               = (known after apply)
      + version                = (known after apply)

      + scaling_config {
          + desired_size = 1
          + max_size     = 1
          + min_size     = 1
        }

      + update_config {
          + max_unavailable = 1
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  ~ endpoint                              = "https://83A2FEC3DDDD7F8F19EF28106401AE41.gr7.us-east-1.eks.amazonaws.com" -> (known after apply)
  ~ kubeconfig-certificate-authority-data = "LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSURCVENDQWUyZ0F3SUJBZ0lJVjJFUHVIbWhMRzR3RFFZSktvWklodmNOQVFFTEJRQXdGVEVUTUJFR0ExVUUKQXhNS2EzVmlaWEp1WlhSbGN6QWVGdzB5TkRBNU1UY3hNVFF3TURaYUZ3MHpOREE1TVRVeE1UUTFNRFphTUJVeApFekFSQmdOVkJBTVRDbXQxWW1WeWJtVjBaWE13Z2dFaU1BMEdDU3FHU0liM0RRRUJBUVVBQTRJQkR3QXdnZ0VLCkFvSUJBUUM2cTE4RHc4OWQ2akErT0tGSVJ6Q3M5aE80OUkzLzBrL3NrVWNneEdBcm9nMVl4UHZ1VEp1T1NwVWgKR05yVzBTVzFFQkhKaUxRS3ZwRUdQZklKd2szbVdBVlZ2M0RweW9ZNXlIbUxUZXFkMjZyTnBHR05DVlBobWRNZApLRDlseGF4OUxTQklFeWhCT0Z0eExtMjh0ZmFNNkhqZ0tnS1NPaDBwMnpSbXVaa3YzbVZudmhmU0Y1LzVsSC9VCnNPd0JUVkFKVDEvRGZqbTRQMmJ4RTR3azZUQlN0RFh4dVVEc0tMSitlUjBoR0F5NWFMRDRCWStJKzZpN2d6WHMKRk1Fbkg5R3N1M1IrbHc2b3hmb2NwakE3L1dkQVdIS0F5TStQdTBxN3lOYXNPcXpsMG5zQnFHVGJyQlo1dTkxSwozcGovODI1WTdPMGdGSzBuN3plL2xSVGw0S0JkQWdNQkFBR2pXVEJYTUE0R0ExVWREd0VCL3dRRUF3SUNwREFQCkJnTlZIUk1CQWY4RUJUQURBUUgvTUIwR0ExVWREZ1FXQkJTK056U2txa3RRRkxGdWlqTFRyT2huT2NEZ1ZEQVYKQmdOVkhSRUVEakFNZ2dwcmRXSmxjbTVsZEdWek1BMEdDU3FHU0liM0RRRUJDd1VBQTRJQkFRQjhObkdlbk1WcwphZ2lFRWVaa1lVVHdvMHpuSUNwYXZJdjNrQk55bFJqbnNHSEkzcVA1SXlxME00ZEI2U3QxNE5peFBwemdYQlB2CjFLNUxDaWovVEtURFhzVVFYS3llcEp1NzBKZExqQTNGbkFUeXVxMmZjL0V4cGpNdkg0bWpJbTlhVm52SXRyVzgKYnVxU212ZDQzMXNJTy9EbENmRkdFbEJac0ZUZUpNME1TREZPMEFqUmJYandXenFNTFJHOEQ2d244UlMrb0haOAprVmtZN3ZhZjFPL2Y3OHdQem4xYWNEQTVRT25hNEtPZStJbEVVaGYwWDNXTTRscUlVTVZlV3hDQmQzaEhTZ3dQCnBIenhmNWIwMDBqRkxQMk1sOE1zQlEyRCtWRVhuQVBWcHlNMTA0QTMrYVZOMFU2M0hqcXVEUmFKRE1NTUhFUGgKNVRNUTQxSkFMUUhVCi0tLS0tRU5EIENFUlRJRklDQVRFLS0tLS0K" -> (known after apply)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @CarlaCCP, Action: `pull_request`*